
/*
 加载时-----------------------------------------------------------------------------------------------------------------
 =======================================================================================================================
 -----------------------------------------------------------------------------------------------------------------------
 */
$(function () {
    $(window).resize();


    $(".introduction a.more").click(function () {
        if($(".introduction a.more").text()=='MORE') {
            $(".introduction a.more").text("LESS");
            $("#intro").css("transform","translateY(0)")
        }
        else if($(".introduction a.more").text()=='LESS') {
            $(".introduction .more").text("MORE");
            $("#intro").css("transform","translateY(200px)")
        }
    });
});
    /*
 窗口改变时-------------------------------------------------------------------------------------------------------------
 =======================================================================================================================
 -----------------------------------------------------------------------------------------------------------------------
 */
$(window).resize(function() {
    var ww=parseInt($("body").css("width"));
    var hh=parseInt($("body").css("height"));
    if(ww/hh>1.8){
        $(".media video").css("height",hh+"px");
        $(".media video").css("width",1.8*hh+"px");
        $(".media video").css("margin-left",(ww-1.8*hh)/2+"px");
    }
    else {
        $(".media video").css("width",ww+"px");
        $(".media video").css("height","auto");
    }
});